pok3r-custom/pok3r_re_firmware/vendor/Holtek/HT32F1655_56_FWLib_v102_960/example/USBD/Mass_Storage/spi_sd.c
/*********************************************************************************************************//**
 * @file    USBD/Mass_Storage/spi_sd.c
 * @version $Rev:: 929          $
 * @date    $Date:: 2015-09-16 #$
 * @brief   The SD Memory card driver. Supports both SD and SDHC.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) 2014 Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32.h"
#include "spi_sd.h"

/** @addtogroup HT32_Series_Peripheral_Examples HT32 Peripheral Examples
  * @{
  */

/** @addtogroup USBD_Examples USBD
  * @{
  */

/** @addtogroup Mass_Storage
  * @{
  */


/* Private constants ---------------------------------------------------------------------------------------*/
#define SD_DUMMY_DATA                     (0xFF)

/*----------------------------------------------------------------------------------------------------------*/
/* Start Data Tokens                                                                                        */
/*----------------------------------------------------------------------------------------------------------*/
#define SD_START_SINGLE_BLOCK_READ        (0xFE)
#define SD_START_SINGLE_BLOCK_WRITE       (0xFE)
#define SD_START_MULTIPLE_BLOCK_READ      (0xFE)
#define SD_START_MULTIPLE_BLOCK_WRITE     (0xFC)
#define SD_STOP_MULTIPLE_BLOCK_WRITE      (0xFD)

/*----------------------------------------------------------------------------------------------------------*/
/* SD Commands                                                                                              */
/*----------------------------------------------------------------------------------------------------------*/
#define SD_CMD00_GO_IDLE_STATE            (0)    /* 0x40                                                    */
#define SD_CMD01_SEND_OP_COND             (1)    /* 0x41                                                    */
#define SD_CMD08_SEND_IF_COMD             (8)    /* 0x48                                                    */
#define SD_CMD09_SEND_CSD                 (9)    /* 0x49                                                    */
#define SD_CMD10_SEND_CID                 (10)   /* 0x4A                                                    */
#define SD_CMD12_STOP_TRAN                (12)   /* 0x4C                                                    */
#define SD_CMD13_SEND_STATUS              (13)   /* 0x4D                                                    */
#define SD_CMD55_APP_CMD                  (55)   /* 0x77                                                    */
#define SD_CMD58_READ_OCR                 (58)   /* 0x7A                                                    */
#define SD_ACMD41_SEND_OP_COND            (41)   /* 0x69                                                    */

#define SD_READ_SINGLE_BLOCK              (17)   /* 0x51                                                    */
#define SD_READ_MULTIPLE_BLOCK            (18)   /* 0x52                                                    */
#define SD_WRITE_BLOCK                    (24)   /* 0x58                                                    */
#define SD_WRITE_MULTIPLE_BLOCK           (25)   /* 0x59                                                    */

/*----------------------------------------------------------------------------------------------------------*/
/* Write Data Response                                                                                      */
/*----------------------------------------------------------------------------------------------------------*/
#define SD_DATA_OK                        (0x5)
#define SD_DATA_CRC_ERROR                 (0xB)
#define SD_DATA_WRITE_ERROR               (0xD)
#define SD_DATA_ERROR                     (0xF)

/* Private function prototypes -----------------------------------------------------------------------------*/
static u8 SD_ReadByte(void);
//static void SD_WriteByte(u8 uData);
static void SD_SendCmd(u32 uCmd, u32 uParameter, u32 uCrc);
static u32 SD_GetResponse(u8 uResponse);
static u32 SD_GetDataResponse(void);
//static u32 SD_GetStatus(void);
static u32 SD_SetIdleStateSPI(void);
static void SD_ClearSPIFIFO(void);
static void SPI_Configuration(u32 uSpeed);

/* Private macro -------------------------------------------------------------------------------------------*/
#if (SD_DEBUG == 1)
#define SDDBG   printf
#else
#define SDDBG(...)
#endif

#define SD_WriteByte(uData)  SPI_SendData(SD_SPI_PORT, uData)

