pok3r-custom/pok3r_re_firmware/vendor/Holtek/HT32F1655_56_FWLib_v102_960/example/USBD/Mass_Storage/spi_sd.c
/* Global variables ----------------------------------------------------------------------------------------*/
u32 uSD_IsSDHC = FALSE;

/* Private variables ---------------------------------------------------------------------------------------*/
/* Global functions ----------------------------------------------------------------------------------------*/

/*********************************************************************************************************//**
  * @brief  The initial function of SD Memory card driver.
  * @retval result: SD_RESPONSE_ERR: SD card response failed.
  *                 SD_RESPONSE_NOERR: SD card response is successfully.
  ***********************************************************************************************************/
u32 SD_Init(void)
{
  u8 uResult;
  s32 i;
  u32 uTimeoutCount = SD_INIT_CNT;

  if (SD_IsCardDetected() == FALSE)
  {
    return SD_RESPONSE_ERR;
  }

  SPI_Configuration(SD_SPI_DIV);

  SDDBG("SD: CMD00\t");
  do
  {
    SD_CS_INACTIVE();
    for (i = 10; i > 0; i--)
    {
      SD_WriteByte(SD_DUMMY_DATA);
    }
    while (SPI_GetFlagStatus(SD_SPI_PORT, SPI_FLAG_BUSY));

    SD_CS_ACTIVE();

    SD_SendCmd(SD_CMD00_GO_IDLE_STATE, 0, 0x95);
    uResult = SD_GetResponse(SD_IN_IDLE_STATE);
    uTimeoutCount--;

  } while ((uResult != SD_RESPONSE_NOERR) && (uTimeoutCount));


  if (uTimeoutCount == 0)
  {
    SDDBG("Failed\r\n");
    return SD_RESPONSE_ERR;
  }
  SDDBG("OK\r\n");
  return (SD_SetIdleStateSPI());
}

/*********************************************************************************************************//**
  * @brief  Read a block of data from SD card.
  * @param  pBuf: Point to the buffer of received data from SD card
  * @param  uReadAddr: The start address of SD card read operation
  * @param  uReadSize: The number of byte data that read from SD card
  * @retval uResult: SD_RESPONSE_ERR: SD card response failed.
  *                  SD_RESPONSE_NOERR: SD card response is successfully.
  ***********************************************************************************************************/
u32 SD_ReadBlock(u8* pBuf, u32 uReadAddr, u32 uReadSize)
{
  u8 uResult = SD_RESPONSE_ERR;
  s32 i;
  //s32 j;

#if (SDHC_SUPPORT == 1)
  if (uSD_IsSDHC == FALSE)
#endif
  {
    uReadAddr *= SD_BLOCK_SIZE;
  }

  SDDBG("SD: Read block, addr[%d] size[%d]\r\n", uReadAddr, uReadSize);

  SD_CS_ACTIVE();
  SD_SendCmd(SD_READ_SINGLE_BLOCK, uReadAddr, 0xFF);

  /* Wait for response in the R1 format (0x00 is no errors)                                                 */
  if (!SD_GetResponse(SD_RESPONSE_NOERR))
  {
    /* Wait for data token start byte                                                                       */
    if (!SD_GetResponse(SD_START_SINGLE_BLOCK_READ))
    {
      for (i = uReadSize / 8; i > 0; i--)
      {
        #if 0
        for (j = 8; j > 0; j--)
        {
          SPI_SendData(SD_SPI_PORT, SD_DUMMY_DATA);
        }
        #else
        SD_SPI_PORT->DR = SD_DUMMY_DATA;
        SD_SPI_PORT->DR = SD_DUMMY_DATA;
        SD_SPI_PORT->DR = SD_DUMMY_DATA;
        SD_SPI_PORT->DR = SD_DUMMY_DATA;
        SD_SPI_PORT->DR = SD_DUMMY_DATA;
        SD_SPI_PORT->DR = SD_DUMMY_DATA;
        SD_SPI_PORT->DR = SD_DUMMY_DATA;
        SD_SPI_PORT->DR = SD_DUMMY_DATA;
        #endif

        //while (SPI_GetFIFOStatus(SD_SPI_PORT, SPI_FIFO_RX) != 8);
        while (((SD_SPI_PORT->FSR & 0xf0) >> 4) != 8);

        #if 0
        for (j = 8; j > 0; j--)
        {
          *pBuf++ = SPI_ReceiveData(SD_SPI_PORT);
        }
        #else
        *pBuf++ = SD_SPI_PORT->DR;
        *pBuf++ = SD_SPI_PORT->DR;
        *pBuf++ = SD_SPI_PORT->DR;
        *pBuf++ = SD_SPI_PORT->DR;
        *pBuf++ = SD_SPI_PORT->DR;
        *pBuf++ = SD_SPI_PORT->DR;
        *pBuf++ = SD_SPI_PORT->DR;
        *pBuf++ = SD_SPI_PORT->DR;
        #endif
      }

      /* Get 16-bit CRC                                                                                     */
      //SD_ReadByte();
      //SD_ReadByte();
      SD_SPI_PORT->DR = SD_DUMMY_DATA;
      SD_SPI_PORT->DR = SD_DUMMY_DATA;

      /* Set response value to success                                                                      */
      uResult = SD_RESPONSE_NOERR;
    }
    else
    {
      SDDBG("\r\nI. Read block error!!\r\n");
    }
  }
  else
  {
    SDDBG("\r\nII. Read block error!!\r\n");
  }

  SD_CS_INACTIVE();
  SD_WriteByte(SD_DUMMY_DATA);

  return uResult;
}

/*********************************************************************************************************//**
  * @brief  Read multiple block of data from SD card.
  * @param  pBuf: Point to the buffer of received data from SD card
  * @param  uReadAddr: The start address of SD card read operation
  * @param  uReadSize: The number of byte data that read from SD card
  * @retval uResult: SD_RESPONSE_ERR: SD card response failed.
  *                  SD_RESPONSE_NOERR: SD card response is successfully.
  ***********************************************************************************************************/
u32 SD_ReadMultipleBlock(u8* pBuf, u32 uReadAddr, u32 uReadSize)
{
  u32 uResult = SD_RESPONSE_ERR;
  u32 uReadCount;
  s32 i;

#if (SDHC_SUPPORT == 1)
  if (uSD_IsSDHC == FALSE)
#endif
  {
    uReadAddr *= SD_BLOCK_SIZE;
  }

  uReadCount = uReadSize / SD_BLOCK_SIZE;

  SDDBG("SD: Read multiple block, addr[%d] size[%d]\r\n", uReadAddr, uReadSize);

  SD_CS_ACTIVE();
  SD_SendCmd(SD_READ_MULTIPLE_BLOCK, uReadAddr, 0xFF);
  if (SD_GetResponse(SD_RESPONSE_NOERR))
  {
    return SD_RESPONSE_ERR;
  }

  while (uReadCount--)
  {
    if (!SD_GetResponse(SD_START_MULTIPLE_BLOCK_READ))
    {
      #if 0
      for (i = SD_BLOCK_SIZE; i > 0; i--)
      {
        *pBuf++ = SD_ReadByte();
      }
      #endif
      for (i = SD_BLOCK_SIZE / 8; i > 0; i--)
      {
        SD_SPI_PORT->DR = SD_DUMMY_DATA;
        SD_SPI_PORT->DR = SD_DUMMY_DATA;
        SD_SPI_PORT->DR = SD_DUMMY_DATA;
        SD_SPI_PORT->DR = SD_DUMMY_DATA;
        SD_SPI_PORT->DR = SD_DUMMY_DATA;
        SD_SPI_PORT->DR = SD_DUMMY_DATA;
        SD_SPI_PORT->DR = SD_DUMMY_DATA;
        SD_SPI_PORT->DR = SD_DUMMY_DATA;

        while (((SD_SPI_PORT->FSR & 0xf0) >> 4) != 8);

        *pBuf++ = SD_SPI_PORT->DR;
        *pBuf++ = SD_SPI_PORT->DR;
        *pBuf++ = SD_SPI_PORT->DR;
        *pBuf++ = SD_SPI_PORT->DR;
        *pBuf++ = SD_SPI_PORT->DR;
        *pBuf++ = SD_SPI_PORT->DR;
        *pBuf++ = SD_SPI_PORT->DR;
        *pBuf++ = SD_SPI_PORT->DR;
      }

