pok3r-custom/pok3r_re_firmware/vendor/Holtek/HT32F1655_56_FWLib_v102_960/example/USBD/Mass_Storage/spi_sd.c
      //SD_ReadByte();
      //SD_ReadByte();
      SD_SPI_PORT->DR = SD_DUMMY_DATA;
      SD_SPI_PORT->DR = SD_DUMMY_DATA;

      uResult = SD_RESPONSE_NOERR;
    }
    else
    {
      uResult = SD_RESPONSE_ERR;
    }
  }

  SD_WriteByte(SD_DUMMY_DATA);
  SD_SendCmd(SD_CMD12_STOP_TRAN, 0x0, 0x0);

  if (SD_GetResponse(SD_RESPONSE_NOERR))
  {
    return SD_RESPONSE_ERR;
  }

  while (SD_IsReadBusy() == TRUE);

  SD_CS_INACTIVE();
  SD_WriteByte(SD_DUMMY_DATA);

  return uResult;
}

/*********************************************************************************************************//**
  * @brief  Write a block of data to SD card.
  * @param  pBuf: Point to the buffer of data be written to SD card.
  * @param  uWritedAddr: The start address of SD card write operation.
  * @param  uWriteSize: The number of byte data that write to SD card.
  * @retval uResult: SD_RESPONSE_ERR: SD card response failed.
  *                  SD_RESPONSE_NOERR: SD card response is successfully.
  ***********************************************************************************************************/
u32 SD_WriteBlock(u8* pBuf, u32 uWritedAddr, u32 uWriteSize)
{
  u32 uResult = SD_RESPONSE_ERR;
  s32 i;
  //s32 j;

#if (SDHC_SUPPORT == 1)
  if (uSD_IsSDHC == FALSE)
#endif
  {
    uWritedAddr *= SD_BLOCK_SIZE;
  }

  SDDBG("SD: Write block, addr[%d] size[%d]\r\n", uWritedAddr, uWriteSize);

  SD_CS_ACTIVE();
  SD_SendCmd(SD_WRITE_BLOCK, uWritedAddr, 0xFF);

  /* Wait for response in the R1 format (0x00 is no errors)                                                 */
  if (!SD_GetResponse(SD_RESPONSE_NOERR))
  {
    SD_WriteByte(SD_DUMMY_DATA);
    SD_WriteByte(SD_START_SINGLE_BLOCK_WRITE);  /* Start Block token                                        */
    while (SPI_GetFlagStatus(SD_SPI_PORT, SPI_FLAG_BUSY));

    for (i = uWriteSize / 8; i > 0 ; i--)
    {
      /* Wait until Tx FIFO empty                                                                           */
      //while (SPI_GetFIFOStatus(SD_SPI_PORT, SPI_FIFO_TX) != 0);
      while ((SD_SPI_PORT->FSR & 0xf) != 0);

      #if 0
      for (j = 8; j > 0; j--)
      {
        SPI_SendData(SD_SPI_PORT, *pBuf++);
      }
      #else
      SD_SPI_PORT->DR = *pBuf++;
      SD_SPI_PORT->DR = *pBuf++;
      SD_SPI_PORT->DR = *pBuf++;
      SD_SPI_PORT->DR = *pBuf++;
      SD_SPI_PORT->DR = *pBuf++;
      SD_SPI_PORT->DR = *pBuf++;
      SD_SPI_PORT->DR = *pBuf++;
      SD_SPI_PORT->DR = *pBuf++;
      #endif
    }

    //SD_ClearSPIFIFO();

    /* Get 16-bit CRC                                                                                       */
    //SD_ReadByte();
    //SD_ReadByte();
    SD_SPI_PORT->DR = SD_DUMMY_DATA;
    SD_SPI_PORT->DR = SD_DUMMY_DATA;

    /* Set response value to success                                                                        */
    if (SD_GetDataResponse() == SD_DATA_OK)
    {
      uResult = SD_RESPONSE_NOERR;
    }
    else
    {
      SDDBG("\r\nWrite block response error!!\r\n");
    }
  }
  else
  {
    SDDBG("\r\nWrite block error!!\r\n");
  }

  SD_CS_INACTIVE();
  SD_WriteByte(SD_DUMMY_DATA);

  return uResult;
}

/*********************************************************************************************************//**
  * @brief  Write multiple block of data to SD card..
  * @param  pBuf: Point to the buffer of data be written to SD card.
  * @param  uWritedAddr: The start address of SD card write operation.
  * @param  uWriteSize: The number of byte data that write to SD card.
  * @retval uResult: SD_RESPONSE_ERR: SD card response failed.
  *                  SD_RESPONSE_NOERR: SD card response is successfully.
  ***********************************************************************************************************/
u32 SD_WriteMultipleBlock(u8* pBuf, u32 uWritedAddr, u32 uWriteSize)
{
  u32 uResult = SD_RESPONSE_ERR;
  s32 i;
  u32 uBlockCount;

#if (SDHC_SUPPORT == 1)
  if (uSD_IsSDHC == FALSE)
#endif
  {
    uWritedAddr *= SD_BLOCK_SIZE;
  }

  uBlockCount = uWriteSize / SD_BLOCK_SIZE;

  SDDBG("SD: Write multiple block, addr[%d] size[%d]\r\n", uWritedAddr, uWriteSize);

  SD_CS_ACTIVE();
  SD_SendCmd(SD_WRITE_MULTIPLE_BLOCK, uWritedAddr, 0xFF);
  if (SD_GetResponse(SD_RESPONSE_NOERR))
  {
    return SD_RESPONSE_ERR;
  }

  while (uBlockCount--)
  {
    /* Send start multiple block token                                                                      */
    //SD_WriteByte(SD_DUMMY_DATA);
    //SD_WriteByte(SD_START_MULTIPLE_BLOCK_WRITE);
    SD_SPI_PORT->DR = SD_DUMMY_DATA;
    SD_SPI_PORT->DR = SD_START_MULTIPLE_BLOCK_WRITE;

    for (i = SD_BLOCK_SIZE / 8; i > 0; i--)
    {
      while ((SD_SPI_PORT->FSR & 0xf) != 0);

      SD_SPI_PORT->DR = *pBuf++;
      SD_SPI_PORT->DR = *pBuf++;
      SD_SPI_PORT->DR = *pBuf++;
      SD_SPI_PORT->DR = *pBuf++;
      SD_SPI_PORT->DR = *pBuf++;
      SD_SPI_PORT->DR = *pBuf++;
      SD_SPI_PORT->DR = *pBuf++;
      SD_SPI_PORT->DR = *pBuf++;
    }

    //SD_ClearSPIFIFO();

    /* Get 16-bit CRC                                                                                       */
    //SD_ReadByte();
    //SD_ReadByte();
    SD_SPI_PORT->DR = SD_DUMMY_DATA;
    SD_SPI_PORT->DR = SD_DUMMY_DATA;

    /* Set response value to success                                                                        */
    if (SD_GetDataResponse() == SD_DATA_OK)
    {
      uResult = SD_RESPONSE_NOERR;
    }
    else
    {
      SDDBG("\r\nData response error!\r\n");
      uResult = SD_RESPONSE_ERR;
      break;
    }

    while (SD_IsWriteBusy());
  }

  /* Send multiple block stop write token                                                                   */
  SD_WriteByte(SD_DUMMY_DATA);
  SD_WriteByte(SD_STOP_MULTIPLE_BLOCK_WRITE);

  while (SD_IsWriteBusy());

  SD_CS_INACTIVE();
  SD_WriteByte(SD_DUMMY_DATA);

  return uResult;
}

