pok3r-custom/pok3r_re_firmware/vendor/Holtek/HT32F1655_56_FWLib_v102_960/example/USBD/Mass_Storage/spi_sd.c
/*********************************************************************************************************//**
  * @brief  Get CSD Register from Sd Card..
  * @param  SD_CSD: structure point of CSD register.
  * @retval uStatus: SD_RESPONSE_ERR: SD card response failed.
  *                  SD_RESPONSE_NOERR: SD card response is successfully.
  ***********************************************************************************************************/
u32 SD_GetCSDRegister(SD_CSD_TypeDef* SD_CSD)
{
  u32 i;
  u32 uStatus = SD_RESPONSE_ERR;
  u8 uCSDTab[16];

  SD_CS_ACTIVE();
  SD_SendCmd(SD_CMD09_SEND_CSD, 0, 0xFF);

  /* Wait for response in the R1 format (0x00 is no errors)                                                 */
  if (!SD_GetResponse(SD_RESPONSE_NOERR))
  {
    /* Wait for data token start byte                                                                       */
    if (!SD_GetResponse(SD_START_SINGLE_BLOCK_READ))
    {
      for (i = 0; i < 16; i++)
      {
        /* Store CSD register value on CSD_Tab                                                              */
        uCSDTab[i] = SD_ReadByte();
      }

      /* Get 16-bit CRC                                                                                     */
      SD_WriteByte(SD_DUMMY_DATA);
      SD_WriteByte(SD_DUMMY_DATA);

      /* Set response value to success                                                                      */
      uStatus = SD_RESPONSE_NOERR;
    }
  }

  for (i = 3; i > 0; i--)
  {
    SD_WriteByte(SD_DUMMY_DATA);
  }
  SD_CS_INACTIVE();
  SD_WriteByte(SD_DUMMY_DATA);

  /* Byte 0                                                                                                 */
  SD_CSD->CSDStruct            = (uCSDTab[0] & 0xC0) >> 6;
  SD_CSD->SysSpecVersion       = (uCSDTab[0] & 0x3C) >> 2;
  SD_CSD->Reserved1            = uCSDTab[0] & 0x03;
  /* Byte 1                                                                                                 */
  SD_CSD->TAAC                 = uCSDTab[1];
  /* Byte 2                                                                                                 */
  SD_CSD->NSAC                 = uCSDTab[2];
  /* Byte 3                                                                                                 */
  SD_CSD->MaxBusClkFrec        = uCSDTab[3];
  /* Byte 4                                                                                                 */
  SD_CSD->CardComdClasses      = uCSDTab[4] << 4;
  /* Byte 5                                                                                                 */
  SD_CSD->CardComdClasses     |= (uCSDTab[5] & 0xF0) >> 4;
  SD_CSD->RdBlockLen           = uCSDTab[5] & 0x0F;
  /* Byte 6                                                                                                 */
  SD_CSD->PartBlockRead        = (uCSDTab[6] & 0x80) >> 7;
  SD_CSD->WrBlockMisalign      = (uCSDTab[6] & 0x40) >> 6;
  SD_CSD->RdBlockMisalign      = (uCSDTab[6] & 0x20) >> 5;
  SD_CSD->DSRImpl              = (uCSDTab[6] & 0x10) >> 4;
  SD_CSD->Reserved2            = 0;
  SD_CSD->DeviceSize           = (uCSDTab[6] & 0x03) << 10;
  /* Byte 7                                                                                                 */
  SD_CSD->DeviceSize          |= (uCSDTab[7]) << 2;
  /* Byte 8                                                                                                 */
  SD_CSD->DeviceSize          |= (uCSDTab[8] & 0xC0) >> 6;
  SD_CSD->MaxRdCurrentVDDMin   = (uCSDTab[8] & 0x38) >> 3;
  SD_CSD->MaxRdCurrentVDDMax   = (uCSDTab[8] & 0x07);
  /* Byte 9                                                                                                 */
  SD_CSD->MaxWrCurrentVDDMin   = (uCSDTab[9] & 0xE0) >> 5;
  SD_CSD->MaxWrCurrentVDDMax   = (uCSDTab[9] & 0x1C) >> 2;
  SD_CSD->DeviceSizeMul        = (uCSDTab[9] & 0x03) << 1;
  /* Byte 10                                                                                                */
  SD_CSD->DeviceSizeMul       |= (uCSDTab[10] & 0x80) >> 7;
  SD_CSD->EraseGrSize          = (uCSDTab[10] & 0x7C) >> 2;
  SD_CSD->EraseGrMul           = (uCSDTab[10] & 0x03) << 3;
  /* Byte 11                                                                                                */
  SD_CSD->EraseGrMul          |= (uCSDTab[11] & 0xE0) >> 5;
  SD_CSD->WrProtectGrSize      = (uCSDTab[11] & 0x1F);
  /* Byte 12                                                                                                */
  SD_CSD->WrProtectGrEnable    = (uCSDTab[12] & 0x80) >> 7;
  SD_CSD->ManDeflECC           = (uCSDTab[12] & 0x60) >> 5;
  SD_CSD->WrSpeedFact          = (uCSDTab[12] & 0x1C) >> 2;
  SD_CSD->MaxWrBlockLen        = (uCSDTab[12] & 0x03) << 2;
  /* Byte 13                                                                                                */
  SD_CSD->MaxWrBlockLen       |= (uCSDTab[13] & 0xc0) >> 6;
  SD_CSD->WriteBlockPaPartial  = (uCSDTab[13] & 0x20) >> 5;
  SD_CSD->Reserved3            = 0;
  SD_CSD->ContentProtectAppli  = (uCSDTab[13] & 0x01);
  /* Byte 14                                                                                                */
  SD_CSD->FileFormatGrouop     = (uCSDTab[14] & 0x80) >> 7;
  SD_CSD->CopyFlag             = (uCSDTab[14] & 0x40) >> 6;
  SD_CSD->PermWrProtect        = (uCSDTab[14] & 0x20) >> 5;
  SD_CSD->TempWrProtect        = (uCSDTab[14] & 0x10) >> 4;
  SD_CSD->FileFormat           = (uCSDTab[14] & 0x0C) >> 2;
  SD_CSD->ECC                  = (uCSDTab[14] & 0x03);
  /* Byte 15                                                                                                */
  SD_CSD->msd_CRC              = (uCSDTab[15] & 0xFE) >> 1;
  SD_CSD->Reserved4            = 1;

#if (SDHC_SUPPORT == 1)
  if (uSD_IsSDHC == 1)
  {
    /* Byte 7                                                                                               */
    SD_CSD->DeviceSize = (u16)(uCSDTab[8]) * 256;
    /* Byte 8                                                                                               */
    SD_CSD->DeviceSize += uCSDTab[9];
  }
#endif

  /* Return the response                                                                                    */
  return uStatus;
}

