pok3r-custom/pok3r_re_firmware/vendor/Holtek/HT32F1655_56_FWLib_v102_960/example/USBD/Mass_Storage/spi_sd.c
/*********************************************************************************************************//**
  * @brief  Get CID Register from Sd Card.
  * @param  SD_CID: structure point of CID register.
  * @retval uStatus: SD_RESPONSE_ERR: SD card response failed.
  *                  SD_RESPONSE_NOERR: SD card response is successfully.
  ***********************************************************************************************************/
u32 SD_GetCIDRegister(SD_CID_TypeDef* SD_CID)
{
  u32 i = 0;
  u32 uStatus = SD_RESPONSE_ERR;
  u8 uCIDTab[16];

  SD_CS_ACTIVE();
  SD_SendCmd(SD_CMD10_SEND_CID, 0, 0xFF);

  /* Wait for response in the R1 format (0x00 is no errors)                                                 */
  if (!SD_GetResponse(SD_RESPONSE_NOERR))
  {
    if (!SD_GetResponse(SD_START_SINGLE_BLOCK_READ))
    {
      /* Store CID register value on CID_Tab                                                                */
      for (i = 0; i < 16; i++)
      {
        uCIDTab[i] = SD_ReadByte();
      }
    }
    /* Get 16-bit CRC                                                                                       */
    SD_WriteByte(SD_DUMMY_DATA);
    SD_WriteByte(SD_DUMMY_DATA);
    /* Set response value to success                                                                        */
    uStatus = SD_RESPONSE_NOERR;
  }

  for (i = 3; i > 0; i--)
  {
    SD_WriteByte(SD_DUMMY_DATA);
  }
  SD_CS_INACTIVE();
  SD_WriteByte(SD_DUMMY_DATA);

  /* Byte 0                                                                                                 */
  SD_CID->ManufacturerID = uCIDTab[0];
  /* Byte 1                                                                                                 */
  SD_CID->OEM_AppliID = uCIDTab[1] << 8;
  /* Byte 2                                                                                                 */
  SD_CID->OEM_AppliID |= uCIDTab[2];
  /* Byte 3                                                                                                 */
  SD_CID->ProdName1 = uCIDTab[3] << 24;
  /* Byte 4                                                                                                 */
  SD_CID->ProdName1 |= uCIDTab[4] << 16;
  /* Byte 5                                                                                                 */
  SD_CID->ProdName1 |= uCIDTab[5] << 8;
  /* Byte 6                                                                                                 */
  SD_CID->ProdName1 |= uCIDTab[6];
  /* Byte 7                                                                                                 */
  SD_CID->ProdName2 = uCIDTab[7];
  /* Byte 8                                                                                                 */
  SD_CID->ProdRev = uCIDTab[8];
  /* Byte 9                                                                                                 */
  SD_CID->ProdSN = uCIDTab[9] << 24;
  /* Byte 10                                                                                                */
  SD_CID->ProdSN |= uCIDTab[10] << 16;
  /* Byte 11                                                                                                */
  SD_CID->ProdSN |= uCIDTab[11] << 8;
  /* Byte 12                                                                                                */
  SD_CID->ProdSN |= uCIDTab[12];
  /* Byte 13                                                                                                */
  SD_CID->Reserved1 |= (uCIDTab[13] & 0xF0) >> 4;
  /* Byte 14                                                                                                */
  SD_CID->ManufactDate = (uCIDTab[13] & 0x0F) << 8;
  /* Byte 15                                                                                                */
  SD_CID->ManufactDate |= uCIDTab[14];
  /* Byte 16                                                                                                */
  SD_CID->msd_CRC = (uCIDTab[15] & 0xFE) >> 1;
  SD_CID->Reserved2 = 1;

  /* Return the response                                                                                    */
  return uStatus;
}

/*********************************************************************************************************//**
  * @brief  Check the block write status.
  * @retval TRUE: write operation is busy. FALSE: write operation is finished.
  ***********************************************************************************************************/
u32 SD_IsWriteBusy(void)
{
  SD_ClearSPIFIFO();

  //while (SPI_GetFlagStatus(SD_SPI_PORT, SPI_FLAG_BUSY));
  //while ((SD_SPI_PORT->SR & SPI_FLAG_BUSY));

  return((SD_ReadByte() == 0xFF) ? FALSE : TRUE);
}

/*********************************************************************************************************//**
  * @brief  Check the block read status.
  * @retval TRUE: read operation is busy. FALSE: write operation is finished.
  ***********************************************************************************************************/
u32 SD_IsReadBusy(void)
{
  SD_ClearSPIFIFO();

  //while (SPI_GetFlagStatus(SD_SPI_PORT, SPI_FLAG_BUSY));
  //while ((SD_SPI_PORT->SR & SPI_FLAG_BUSY));

  return((SD_ReadByte() == 0x0) ? TRUE : FALSE);
}

/*********************************************************************************************************//**
  * @brief  Check the card inserted or not.
  * @retval TRUE: Card is detected. FALSE Card is not detected.
  ***********************************************************************************************************/
u32 SD_IsCardDetected(void)
{
  return((SD_CD_READ() == 0x0) ? TRUE : FALSE);
}

/* Private functions ---------------------------------------------------------------------------------------*/

/*********************************************************************************************************//**
  * @brief  Read one byte data from SD card.
  * @retval uData: Received data (1 Byte).
  ***********************************************************************************************************/
static u8 SD_ReadByte(void)
{
  u8 uData = 0;

  //SD_ClearSPIFIFO();  //Skip for speed up

