pok3r-custom/pok3r_re_firmware/vendor/Holtek/HT32F1655_56_FWLib_v102_960/example/USBD/Mass_Storage/spi_sd.c
  //SPI_SendData(SD_SPI_PORT, SD_DUMMY_DATA);
  SD_SPI_PORT->DR = SD_DUMMY_DATA;

  /* Wait data ready                                                                                        */
  //while (SPI_GetFIFOStatus(SD_SPI_PORT, SPI_FIFO_RX) == 0);
  while (((SD_SPI_PORT->FSR & 0xf0) >> 4) == 0);

  //uData = SPI_ReceiveData(SD_SPI_PORT);
  uData = SD_SPI_PORT->DR;

  return uData;
}

#if 0
/*********************************************************************************************************//**
  * @brief  Write data to SD card (1 Byte).
  * @param  uData: Data to write
  * @retval None
  ***********************************************************************************************************/
static void SD_WriteByte(u8 uData)
{
  SPI_SendData(SD_SPI_PORT, uData);

  return;
}
#endif

/*********************************************************************************************************//**
  * @brief  Send 6 bytes command to SD card.
  * @param  uCmd: SD command
  * @param  uParameter: Command argument
  * @param  uCrc: CRC7
  * @retval None
  ***********************************************************************************************************/
static void SD_SendCmd(u32 uCmd, u32 uParameter, u32 uCrc)
{
  s32 i;
  u8 uData[6];

  uData[5] = (uCmd | 0x40);
  uData[4] = (u8)(uParameter >> 24);
  uData[3] = (u8)(uParameter >> 16);
  uData[2] = (u8)(uParameter >> 8);
  uData[1] = (u8)(uParameter);
  uData[0] = (uCrc);

  for (i = 5; i >= 0; i--)
  {
    //SD_WriteByte(uData[i]);
    SD_SPI_PORT->DR = uData[i];
  }

  SD_ClearSPIFIFO();

  return;
}

/*********************************************************************************************************//**
  * @brief  Get response from SD card.
  * @param  uResponse: the response token
  * @retval result: SD_RESPONSE_ERR: SD card response failed.
  *                 SD_RESPONSE_NOERR: SD card response is successfully.
  ***********************************************************************************************************/
static u32 SD_GetResponse(u8 uResponse)
{
  u32 uTimeoutCount = SD_GETRSP_CNT;

  SD_ClearSPIFIFO();

  while ((SD_ReadByte() != uResponse) && uTimeoutCount)
  {
    uTimeoutCount--;
  }

  if (uTimeoutCount == 0)
  {
    return SD_RESPONSE_ERR;
  }
  else
  {
    return SD_RESPONSE_NOERR;
  }
}

/*********************************************************************************************************//**
  * @brief  Get data response token form SD card.
  * @retval uResult: SD_DATA_OK, SD_DATA_CRC_ERROR, SD_DATA_WRITE_ERROR, SD_DATA_ERROR
  ***********************************************************************************************************/
static u32 SD_GetDataResponse(void)
{
  u32 uResult = 0;
  u32 uTimeoutCount = SD_GETDRSP_CNT;

  SD_ClearSPIFIFO();

  while (uTimeoutCount--)
  {
    uResult = SD_ReadByte() & 0x1F;  /* Mask data response bit5~7                                           */
    if (uResult == SD_DATA_OK)
    {
      break;
    }
  }

  //if (uTimeoutCount == 0)
  //{
  //  SDDBG("SD: SD_GetDataResponse timeout [%x]\r\n", uResult);
  //}

  /* Wait for data is zero                                                                                  */
  while (SD_ReadByte() == 0);

  return uResult;
}

/*********************************************************************************************************//**
  * @brief  Get status from SD card.
  * @retval uStatus: The SD Card status
  ***********************************************************************************************************/
#if 0
static u32 SD_GetStatus(void)
{
  u32 uStatus;

  SD_CS_ACTIVE();
  SD_SendCmd(SD_CMD13_SEND_STATUS, 0, 0xFF);

  uStatus = SD_ReadByte();
  uStatus |= (u16)(SD_ReadByte() << 8);

  SD_CS_INACTIVE();
  SD_WriteByte(SD_DUMMY_DATA);

  return uStatus;
}
#endif

/*********************************************************************************************************//**
  * @brief  Set SD card as idle state and SPI mode.
  * @retval result: SD_RESPONSE_ERR: SD card response failed.
  *                 SD_RESPONSE_NOERR: SD card response is successfully.
  ***********************************************************************************************************/
static u32 SD_SetIdleStateSPI(void)
{
  u32 uTimeoutCount;
  u32 uResult;
  u32 i;

#if (SDHC_SUPPORT == 1)
  SD_CS_INACTIVE();
  SD_WriteByte(SD_DUMMY_DATA);
  while (SPI_GetFlagStatus(SD_SPI_PORT, SPI_FLAG_BUSY));
  SD_CS_ACTIVE();

  uTimeoutCount = SD_CHECK_VER;

  SDDBG("SD: CMD08\t");
  SD_SendCmd(SD_CMD08_SEND_IF_COMD, 0x1AA, 0x87);

  do
  {
    uResult = SD_ReadByte();
    if (uResult != 0xFF)
    {
      break;
    }
    uTimeoutCount--;
  } while (uTimeoutCount);

  if (uTimeoutCount == 0)
  {
    SDDBG("Failed\r\n");
    return SD_RESPONSE_ERR;
  }
  SDDBG("OK R1=%x\r\n", uResult);

  if (uResult == (SD_IN_IDLE_STATE | SD_ILLEGAL_COMMAND))
  {
    uSD_IsSDHC = FALSE;
#endif

    SDDBG("SD: SD Mode\r\n");

    for (i = 0; i < 3; i++)
    {
      SD_WriteByte(SD_DUMMY_DATA);
    }
    while (SPI_GetFlagStatus(SD_SPI_PORT, SPI_FLAG_BUSY));

    SDDBG("SD: CMD55, ACMD41\t");

    uTimeoutCount = 0xFFFF;
    do
    {
      SD_CS_INACTIVE();
      SD_WriteByte(SD_DUMMY_DATA);
      while (SPI_GetFlagStatus(SD_SPI_PORT, SPI_FLAG_BUSY));

      SD_CS_ACTIVE();
      SD_SendCmd(SD_CMD55_APP_CMD, 0, 0x0);

      for (i = 0; i < 0xFF; i++)
      {
        uResult = SD_ReadByte();
        if (uResult == 0x1)
        {
          break;
        }
      }

      SD_CS_INACTIVE();
      SD_WriteByte(SD_DUMMY_DATA);
      while (SPI_GetFlagStatus(SD_SPI_PORT, SPI_FLAG_BUSY));

      SD_CS_ACTIVE();
      SD_SendCmd(SD_ACMD41_SEND_OP_COND, 0x0, 0x0);

      for (i = 0; i < 0xFF; i++)
      {
        uResult = SD_ReadByte();
        if (uResult != 0xFF)
        {
         break;
        }
      }

      uTimeoutCount--;
    } while (uResult != 0 && uTimeoutCount);

    if (uTimeoutCount == 0)
    {
      SDDBG("Failed\r\n");
      SDDBG("SD: CMD01\t");
      uTimeoutCount = SD_IDLE_CNT;
      do
      {
        SD_CS_INACTIVE();
        SD_WriteByte(SD_DUMMY_DATA);
        while (SPI_GetFlagStatus(SD_SPI_PORT, SPI_FLAG_BUSY));

        SD_CS_ACTIVE();
        SD_SendCmd(SD_CMD01_SEND_OP_COND, 0, 0xFF);
        uTimeoutCount--;
      } while (SD_GetResponse(SD_RESPONSE_NOERR) && uTimeoutCount);

      SD_CS_INACTIVE();
      SD_WriteByte(SD_DUMMY_DATA);

      if (uTimeoutCount == 0)
      {
        SDDBG("Failed\r\n");
        return SD_RESPONSE_ERR;
      }
    }
    for (i = 4; i > 0; i--)
    {
      SD_WriteByte(SD_DUMMY_DATA);
    }
    SD_CS_INACTIVE();
    SD_WriteByte(SD_DUMMY_DATA);
    SDDBG("OK\r\n");
    SPI_Configuration(SD_SPI_DIV_HIGHSPEED);

#if (SDHC_SUPPORT == 1)
  }
  else
  {
    for (i = 0; i < 3; i++)
    {
      SD_WriteByte(SD_DUMMY_DATA);
    }
    while (SPI_GetFlagStatus(SD_SPI_PORT, SPI_FLAG_BUSY));

    SDDBG("SD: CMD55, ACMD41\t");

