pok3r-custom/pok3r_re_firmware/vendor/Holtek/HT32F1655_56_FWLib_v102_960/example/USBD/Mass_Storage/spi_sd.c
    uTimeoutCount = 0xFFFF;
    do
    {
      SD_CS_INACTIVE();
      SD_WriteByte(SD_DUMMY_DATA);
      while (SPI_GetFlagStatus(SD_SPI_PORT, SPI_FLAG_BUSY));

      SD_CS_ACTIVE();
      SD_SendCmd(SD_CMD55_APP_CMD, 0, 0x0);

      for (i = 0; i < 0xFF; i++)
      {
        uResult = SD_ReadByte();
        if (uResult == 0x1)
        {
          break;
        }
      }

      SD_CS_INACTIVE();
      SD_WriteByte(SD_DUMMY_DATA);
      while (SPI_GetFlagStatus(SD_SPI_PORT, SPI_FLAG_BUSY));

      SD_CS_ACTIVE();
      SD_SendCmd(SD_ACMD41_SEND_OP_COND, 0x40000000, 0x0);

      for (i = 0; i < 0xFF; i++)
      {
        uResult = SD_ReadByte();
        if (uResult != 0xFF)
        {
         break;
        }
      }

      uTimeoutCount--;
    } while (uResult != 0 && uTimeoutCount);

    if (uTimeoutCount == 0)
    {
      SDDBG("Failed\r\n");
      return SD_RESPONSE_ERR;
    }
    else
    {
      SDDBG("OK\r\n");
      SD_CS_INACTIVE();
      SD_WriteByte(SD_DUMMY_DATA);
      while (SPI_GetFlagStatus(SD_SPI_PORT, SPI_FLAG_BUSY));

      SD_CS_ACTIVE();

      SDDBG("SD: CMD58\t");
      SD_SendCmd(SD_CMD58_READ_OCR, 0, 0x0);

      for (i = 0; i < 0xFFFFFF; i++)
      {
        uResult = SD_ReadByte();
        if (uResult != 0xFF)
        {
         break;
        }
      }

      if (i == 0xFFFFFF)
      {
        SDDBG("Failed\r\n");
        return SD_RESPONSE_ERR;
      }

      uResult = SD_ReadByte();
      SDDBG("OK OCR %x\r\n", uResult);
      if (uResult & 0x40)
      {
        uSD_IsSDHC = TRUE;
        SDDBG("SD: SDHC Mode\r\n");
      }
      else
      {
        uSD_IsSDHC = FALSE;
        SDDBG("SD: SD Mode\r\n");
      }
      for (i = 4; i > 0; i--)
      {
        SD_WriteByte(SD_DUMMY_DATA);
      }
      SD_CS_INACTIVE();
      SD_WriteByte(SD_DUMMY_DATA);
      SPI_Configuration(SD_SPI_DIV_HIGHSPEED);
    }
  }
#endif

#if 0
      SD_CS_INACTIVE();
      SD_WriteByte(SD_DUMMY_DATA);
      while (SPI_GetFlagStatus(SD_SPI_PORT, SPI_FLAG_BUSY));

      SD_CS_ACTIVE();

      SDDBG("SD: CMD59\t");
      SD_SendCmd(59, 0, 0x0);

      for (i = 0; i < 0xFFFFFF; i++)
      {
        uResult = SD_ReadByte();
        if (uResult != 0xFF)
        {
         break;
        }
      }

      SD_CS_INACTIVE();
      SD_WriteByte(SD_DUMMY_DATA);
#endif

  SD_ClearSPIFIFO();
  return SD_RESPONSE_NOERR;
}

/*********************************************************************************************************//**
  * @brief  Clear SPI FIFO.
  * @retval None
  ***********************************************************************************************************/
static void SD_ClearSPIFIFO(void)
{
  vu32 uTemp;

  //while (SPI_GetFlagStatus(SD_SPI_PORT, SPI_FLAG_BUSY));
  while ((SD_SPI_PORT->SR & SPI_FLAG_BUSY));

  //while (SPI_GetFIFOStatus(SD_SPI_PORT, SPI_FIFO_RX) != 0)
  while (((SD_SPI_PORT->FSR & 0xf0) >> 4) != 0)
  {
    //SPI_ReceiveData(SD_SPI_PORT);
    uTemp = SD_SPI_PORT->DR;
  }
}

/*********************************************************************************************************//**
  * @brief  Configures the SPI Port.
  * @retval None
  ***********************************************************************************************************/
static void SPI_Configuration(u32 uSpeed)
{
  SPI_InitTypeDef SPI_InitStructure;

  SPI_InitStructure.SPI_Mode = SPI_MASTER;
  SPI_InitStructure.SPI_FIFO = SPI_FIFO_ENABLE;
  SPI_InitStructure.SPI_DataLength = SPI_DATALENGTH_8;
  SPI_InitStructure.SPI_SELMode = SPI_SEL_SOFTWARE;
  SPI_InitStructure.SPI_SELPolarity = SPI_SELPOLARITY_LOW;
  SPI_InitStructure.SPI_FirstBit = SPI_FIRSTBIT_MSB;
  SPI_InitStructure.SPI_CPOL = SPI_CPOL_HIGH;
  SPI_InitStructure.SPI_CPHA = SPI_CPHA_SECOND;
  SPI_InitStructure.SPI_RxFIFOTriggerLevel = 0;
  SPI_InitStructure.SPI_TxFIFOTriggerLevel = 0;
  SPI_InitStructure.SPI_ClockPrescaler = uSpeed;
  SPI_Init(SD_SPI_PORT, &SPI_InitStructure);

  SPI_SELOutputCmd(SD_SPI_PORT, ENABLE);

  SPI_Cmd(SD_SPI_PORT, ENABLE);

  return;
}


/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
